// models/image-model.json
{
  "format": "layers-model",
  "generatedBy": "1.15.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "filters": 8,
            "kernel_size": [3, 3],
            "strides": [2, 2],
            "padding": "same",
            "activation": "relu"
          }
        },
        {
          "class_name": "GlobalAveragePooling2D",
          "config": {
            "name": "global_average_pooling2d",
            "trainable": true,
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "units": 6,
            "activation": "softmax"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["image-model.weights.bin"],
      "weights": [
        {"name": "conv2d/kernel", "shape": [3, 3, 3, 8], "dtype": "float32"},
        {"name": "conv2d/bias", "shape": [8], "dtype": "float32"},
        {"name": "dense/kernel", "shape": [8, 6], "dtype": "float32"},
        {"name": "dense/bias", "shape": [6], "dtype": "float32"}
      ]
    }
  ]
}
